// Значення одиниць вимірювання та кількості
let unit = "кг";
let quantity = 10;


//У змінну unit можно записати одиницю вимірювання, яку треба перевести. 
// У змінну quantity можна записати кількість одиниць вимірювання, яку треба перевести

// Змінна для збереження результату переводу
let result;

// Перевірка одиниць вимірювання та переведення їх у відповідність
switch(unit) {
    case "км":
        result = quantity * 1000 + " м";
        break;
    case "год":
        result = quantity * 60 + " хв";
        break;
    case "кг":
        result = quantity * 1000 + " г";
        break;
    default:
        result = "Невідома одиниця вимірювання";
}

console.log(quantity + " " + unit + " це " + result);